---
title: "上三角打印"
date: 2023-03-01T14:26:50+08:00
summary: ""
categories: ["Python"]
tags: [""]
---

#+begin_src python :results output
def triangle_print(n):
    for i in range(1,n+1):
        for j in range(n,0,-1):
            print(len(str(j))*' ' if j>i else j,end=' ')
        print()
triangle_print(12)
#+end_src

#+RESULTS:
#+begin_example
                         1
                       2 1
                     3 2 1
                   4 3 2 1
                 5 4 3 2 1
               6 5 4 3 2 1
             7 6 5 4 3 2 1
           8 7 6 5 4 3 2 1
         9 8 7 6 5 4 3 2 1
      10 9 8 7 6 5 4 3 2 1
   11 10 9 8 7 6 5 4 3 2 1
12 11 10 9 8 7 6 5 4 3 2 1
#+end_example
